#!/usr/bin/env python3
# -*- coding: utf-8 -*-


name = {'1': '131456780001', '2': '131456780002', '3': '131456780003', '4': '131456780004', '5': '131456780005'}
print(name['2'])

dict1={'1':'111111' ,'2':'222222' ,'3':'333333'}
print(dict1)

# 新增一个键值对
dict1['4']='444444'
print(dict1)

# 修改键值对
dict1['1']='555555'
print(dict1)


dict1={'1':'111111' ,'2':'222222' ,'3':'333333'}
print(dict1)

# 通过 key 值，删除对应的元素
del dict1['1']
print(dict1)

# 删除字典中的所有元素
dict1.clear()
print(dict1)

# 删除字典
del dict1


# dict （字典）键必须不可变，可是键可以用数字，字符串或元组充当，但是就是不能使用列表
dict1={'liangdianshui':'111111' ,123:'222222' ,(123,'tom'):'333333','twowater':'444444'}
print(dict1)